
read_verilog -sv exe_unit_w47.sv

copy exe_unit_w47 exe_unit_w47_rtl 

hierarchy -top exe_unit_w47_rtl

synth

abc -g AND,OR,XOR

opt_clean

write_verilog -noattr exe_unit_w47_rtl.sv

stat -tech cmos
